In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
% matplotlib inline
#准备CCSS数据集
ccss = pd.read_excel("ccss_sample.xlsx")
ccss.head()

,time,id,s0,s2,s3,s4,s5,s7,s9,c0_1,...,Qs9,Qa3,Qa4,Qa8,Qa9,Qa10,Qa16,index1,index1a,index1b
0,200704,1,北京,男,20,本科,公司普通职员（白领）,未婚,2000-2999元,0,...,2500.0,100,200,200,200,100,100,109.349371,88.035919,121.071238
1,200704,2,北京,男,24,高中/中专,公司普通职员（白领）,未婚,6000-7999元,0,...,7000.0,100,100,100,150,200,100,93.728032,88.035919,96.856991
2,200704,3,上海,男,20,高中/中专,无业/待业/失业/家庭主妇,未婚,1000-1499元,0,...,1250.0,100,150,150,100,100,100,93.728032,88.035919,96.856991
3,200704,4,北京,女,65,大专,企/事业管理人员,已婚,1000-1499元,0,...,1250.0,150,150,100,100,100,200,109.349371,154.062858,84.749867
4,200704,5,上海,女,40,高中/中专,公司普通职员（白领）,已婚,99拒绝回答,0,...,NaN,100,100,100,100,150,100,85.917363,88.035919,84.749867

In [2]:
# 处理缺失数据
%timeit np.arange(0, 10000, dtype=int).sum()# %time

21.7 µs ± 2.36 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [3]:
%timeit np.arange(0, 10000, dtype=float).sum()# %time

30.7 µs ± 2.01 µs per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [4]:
%timeit np.arange(0, 10000, dtype=object).sum()# %time

1.39 ms ± 60.6 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [5]:
df = DataFrame({'age':[20,21,23,19,22], 'salary':[10000,11000,9900,8500,15000]},
                index = ['张三','李四','小赵','小郭','小齐'], 
                columns = ['age','salary','work'])
df

    age  salary work
张三   20   10000  NaN
李四   21   11000  NaN
小赵   23    9900  NaN
小郭   19    8500  NaN
小齐   22   15000  NaN

In [6]:
df.work['李四':'小郭'] = "Python"

c:\users\administrator\appdata\local\programs\python\python36-32\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [7]:
# 根据获得的数据去除原来数据的空数据
s1 = df.isnull().any(axis = 1)

In [8]:
# 有了S1这个数据,获取哪些数据为空
df[s1]

    age  salary work
张三   20   10000  NaN
小齐   22   15000  NaN

In [9]:
# 保留非空的数据
df.notnull()

     age  salary   work
张三  True    True  False
李四  True    True   True
小赵  True    True   True
小郭  True    True   True
小齐  True    True  False

In [10]:
# notnull（）：判断数据不为空，限定所有的数据都不为空，all()
s2 = df.notnull().any(axis = 1)
s2

张三    True
李四    True
小赵    True
小郭    True
小齐    True
dtype: bool

In [11]:
# 非空的数据
df[s2]

    age  salary    work
张三   20   10000     NaN
李四   21   11000  Python
小赵   23    9900  Python
小郭   19    8500  Python
小齐   22   15000     NaN

In [12]:
# 过滤函数
df.dropna(axis = 1)

    age  salary
张三   20   10000
李四   21   11000
小赵   23    9900
小郭   19    8500
小齐   22   15000

In [13]:
df.dropna(how = 'all')

    age  salary    work
张三   20   10000     NaN
李四   21   11000  Python
小赵   23    9900  Python
小郭   19    8500  Python
小齐   22   15000     NaN

In [14]:
df.loc['张三'] = np.nan
df

     age   salary    work
张三   NaN      NaN     NaN
李四  21.0  11000.0  Python
小赵  23.0   9900.0  Python
小郭  19.0   8500.0  Python
小齐  22.0  15000.0     NaN

In [15]:
df.dropna(how = 'all')

     age   salary    work
李四  21.0  11000.0  Python
小赵  23.0   9900.0  Python
小郭  19.0   8500.0  Python
小齐  22.0  15000.0     NaN

In [16]:
# 对所有的空数据进行替换
df.fillna(value = 'Java')

     age salary    work
张三  Java   Java    Java
李四    21  11000  Python
小赵    23   9900  Python
小郭    19   8500  Python
小齐    22  15000    Java

In [17]:
df.fillna(method = 'backfill')

     age   salary    work
张三  21.0  11000.0  Python
李四  21.0  11000.0  Python
小赵  23.0   9900.0  Python
小郭  19.0   8500.0  Python
小齐  22.0  15000.0     NaN

In [18]:
# f == forward
# inplace == True 原来的数据就会发生变化
df.fillna(method = 'ffill', inplace = True)

In [19]:
df

     age   salary    work
张三   NaN      NaN     NaN
李四  21.0  11000.0  Python
小赵  23.0   9900.0  Python
小郭  19.0   8500.0  Python
小齐  22.0  15000.0  Python

In [20]:
s  = Series([1,2,3,4], index = [['a', 'a', 'b', 'b'],['期中','期末','期中','期末']])
s

a  期中    1
   期末    2
b  期中    3
   期末    4
dtype: int64

In [21]:
df = DataFrame(np.random.randint(0,150,size = (6,3)), 
               columns=['语文','数学','Python'],
               index = [['Michael','Michael','Lisa','Lisa','Po','Po'],
                        ['Mid','End','Mid','End','Mid','End']])
df

              语文   数学  Python
Michael Mid   53   35      54
        End  101   49      13
Lisa    Mid   94   98      46
        End   95   19     144
Po      Mid  148  108      68
        End   21   87     122

In [39]:
df1 = DataFrame(np.random.randint(0,150,size=(6,3)), columns=['Java',"Html5",'Python'],
                index = pd.MultiIndex.from_arrays([['张三','张三','侯少','侯少','温少','温少'],
                                           ['期中','期末','期中','期末','期中','期末']]))
df1

       Java  Html5  Python
张三 期中    56     16      67
   期末   131     49      73
侯少 期中    31     28      42
   期末     6    119      36
温少 期中    22    110       1
   期末    67     13      50

In [23]:
df2 = DataFrame(np.random.randint(0,150,size=(6,3)), 
                columns=['Java',"Html5",'Python'],
                index = pd.MultiIndex.from_tuples([('张三','期中'),('张三','期末'),('李四','期中'),('李四','期末'),('钱多多','期中'),('钱多多','期末')]))
df2

        Java  Html5  Python
张三  期中    76    142     122
    期末    43    142      50
李四  期中   135     73     109
    期末   129    149     125
钱多多 期中    16     78      41
    期末   122    106      15

In [24]:
# 更简便
df3 = DataFrame(np.random.randint(0,150,size=(6,3)), 
                columns=['Java',"Html5",'Python'],
                index = pd.MultiIndex.from_product([['张三','李四','小张'],['期中','期末']]))
df3

       Java  Html5  Python
张三 期中    35     16     141
   期末    15     31      99
李四 期中    94    131      15
   期末   119      1     102
小张 期中    17     43      50
   期末   106     31      65

In [25]:
# 对于DataFrame列同样可以设计多层索引
df4 = DataFrame(np.random.randint(0,150,size=(3,6)), 
                columns = pd.MultiIndex.from_product([['Java',"Html5",'Python'],['期中','期末']]),
                index = ['张三', '李四', '小张'])
df4

   Java     Html5      Python
     期中  期末    期中   期末     期中   期末
张三  113  59    55   51     44  100
李四   26  64   114  136      9   33
小张  114   4    98   13     99  120

In [26]:
s

a  期中    1
   期末    2
b  期中    3
   期末    4
dtype: int64

In [27]:
s['a', '期中']

1

In [28]:
#第一个参数，多层索引的第一维，第二个参数，第二维
s[['a','期中']]

a  期中    1
   期末    2
dtype: int64

In [ ]:
#['a','期中']作为一个参数
s[['a','期中']]

In [29]:
s[['a','b','c']]

a  期中    1
   期末    2
b  期中    3
   期末    4
dtype: int64

In [30]:
s['a':'b']

a  期中    1
   期末    2
b  期中    3
   期末    4
dtype: int64

In [31]:
s.iloc[0:3]

a  期中    1
   期末    2
b  期中    3
dtype: int64

In [32]:
df1

       Java  Html5  Python
张三 期中   109    130      68
   期末   148     91      77
侯少 期中    65    106      87
   期末   137    110     125
温少 期中    11     85      40
   期末    80    148      50

In [37]:
df = DataFrame(np.random.randint(0, 150, size = (3,3)), index = ['张三','侯少','温少'],
              columns = ['Java', 'Html5', 'Python'])
df['张三':'侯少']

    Java  Html5  Python
张三   106     32      68
侯少   104     71     148

In [45]:
df1.index = pd.MultiIndex.from_product([list('一二三'),['期中','期末']])

In [47]:
#包含中文有bug
#df1['一':'二']

In [48]:
df1.iloc[0:3]

      Java  Html5  Python
一 期中    56     16      67
  期末   131     49      73
二 期中    31     28      42

In [49]:
df2.loc['张三','期中']

Java       76
Html5     142
Python    122
Name: (张三, 期中), dtype: int32

In [50]:
df2.loc['张三'].loc['期中']

Java       76
Html5     142
Python    122
Name: 期中, dtype: int32

In [51]:
df2.loc[['张三', '李四']]

       Java  Html5  Python
张三 期中    76    142     122
   期末    43    142      50
李四 期中   135     73     109
   期末   129    149     125

In [61]:
#stack == 堆 --->行
df4.stack(level = 1)

       Html5  Java  Python
张三 期中     55   113      44
   期末     51    59     100
李四 期中    114    26       9
   期末    136    64      33
小张 期中     98   114      99
   期末     13     4     120

In [62]:
df2.unstack()

    Java      Html5      Python
      期中   期末    期中   期末     期中   期末
张三    76   43   142  142    122   50
李四   135  129    73  149    109  125
钱多多   16  122    78  106     41   15

In [63]:
df1.sum(axis = 0)

Java      313
Html5     335
Python    269
dtype: int64

In [65]:
df1.std(axis=1)

一  期中    26.839026
   期末    42.158431
二  期中     7.371115
   期末    58.534890
三  期中    57.830211
   期末    27.610385
dtype: float64

In [66]:
nd = np.random.randint(0, 10, size = (3,3))
nd